# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой
# строке вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых
# чисел Ai. Последняя строка содержит число X

N = int(input("Введите количество элементов массива N : "))
A = []

for i in range(N):
    ai = int(input(f"Введите элемент массива a[{i}]: "))
    A.append(ai)

X = int(input("Введите число X : "))

numbers = 0

for j in range(N):
    if A[j] == X:
        numbers += 1

print("Число встречается", numbers, 'раз')
