# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. Пользователь в
# первой строке вводит натуральное число N – количество элементов в массиве. В последующих  строках записаны N целых
# чисел Ai. Последняя строка содержит число X

N = int(input("Введите количество элементов массива N : "))
A = []

for i in range(N):
    ai = int(input(f"Введите элемент массива a[{i}]: "))
    A.append(ai)

X = int(input("Введите число X : "))

delta = 0
value = A[0]

for j in range(N):
    delta_j = A[j] - X

    if delta_j < 0:
        delta_j *= -1

    if j ==0:
        delta = delta_j
        value = A[j]
    elif delta_j < delta:
        delta = delta_j
        value = A[j]

print("Самый близкий по величине элемент", value)
