# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается
# сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

# минимальный разлом n * 1 или m * 1.
# значит, можно разломить, если кратно минимальному разлому, но меньше самой плитки

m = int(input("Введите размер плитки m: "))
n = int(input("Введите размер плитки n: "))

k = int(input("Сколько долек нужно отломить? k: "))

if k > m * n:
    print('Требуется отломить больше долек, чем есть в плитке')
elif k == m * n:
    print('Требуется отломить столько же долек, сколько есть в плитке')
elif k % m == 0 or k % n == 0:
    print("Разломить можно")
else:
    print("Разломить нельзя")
