# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите
# минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же
# стороной. Выведите минимальное количество монет, которые нужно перевернуть

n = int(input("Введите количество монет: "))

count_image = 0
count_number = 0

for i in range(n):
    m = int(input("Орел (1) или решка (0) : "))
    if m == 0:
        count_image += 1
    else:
        count_number += 1

if count_number > count_image:
    print('Нужно перевернуть', count_image, "монет ""Орлом""")
elif count_number < count_image:
    print('Нужно перевернуть', count_number, "монет ""Решкой""")
else:
    print('Нужно перевернуть', count_number, "монет")
