# Задача 2: Найдите сумму цифр трехзначного числа.

number = input("Введите трехзначное число: ")

result = int(number[0]) + int(number[1]) + int(number[2])
print(result)